#include "foc.h"
/*
Á´Â·

 STM32G431
                           ©¦
                  Position / Speed
                           ©¦
                           ¨‹
                    iq_ref / id_ref
                           ©¦
                           ¨‹
 Ia ©¤©¤©´              ©°©¤©¤©¤©¤©¤©¤©¤©¤©¤©¤©¤©¤©¤©´
				©À©¤©¤©¤©¤©¤©¤©¤©¤©¤©¤©¤©¤©¤?©¦ Clarke      ©¦
 Ib ©¤©¤©¼              ©¸©¤©¤©¤©¤©¤©¤©Ð©¤©¤©¤©¤©¤©¤©¼
                            ©¦
                          I¦Á I¦Â
                            ©¦
                            ¨‹
                      ©°©¤©¤©¤©¤©¤©¤©¤©¤©¤©¤©´
Encoder ©¤©¤¦Èe©¤©¤©¤©¤©¦ Park  					   ©¦
                      ©¸©¤©¤©¤©¤©Ð©¤©¤©¤©¤©¤©¼
                           ©¦
                          Id Iq
                           ©¦
                           ¨‹
                      Id/Iq PI
                           ©¦
                          Vd Vq
                           ©¦
                           ¨‹
                     Inv Park
                           ©¦
                          V¦Á V¦Â
                           ©¦
                           ¨‹
                        SVPWM
                     ©°©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©´
                     ©¦     ©¦     ©¦
                   DutyU DutyV DutyW
                     ©¦     ©¦     ©¦
                 TIM1_CH1 CH2   CH3
                     ©¦     ©¦     ©¦
                     ¨‹     ¨‹     ¨‹
                   IN1   IN2   IN3
                    ©¸©¤©¤©¤©¤©¤©Ð©¤©¤©¤©¤©¤©¼
                          ©¦
                       DRV8313
                    ©°©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©´
                    ¨‹     ¨‹     ¨‹
                   OUT1  OUT2  OUT3
                    U     V     W
                       PMSM



*/







